# Path Reinforcement Is Valid Rebar Shape Id Method

Source: https://www.revitapidocs.com/2026/0d570de9-c041-3bf2-dff7-47720ee6ace7.htm

---

| Path Reinforcement Is Valid Rebar Shape Id Method |
| --- |

Identifies whether an element id corresponds to a Rebar Shape element which can be used in Path Reinforcement.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static bool IsValidRebarShapeId(
	Document aDoc,
	ElementId elementId
)
```

```
Public Shared Function IsValidRebarShapeId (
	aDoc As Document,
	elementId As ElementId
) As Boolean
```

```
public:
static bool IsValidRebarShapeId(
	Document^ aDoc,
	ElementId^ elementId
)
```

```
static member IsValidRebarShapeId :
        aDoc : Document *
        elementId : ElementId -> bool
```

#### Parameters

aDoc Document
:   The document.

elementId ElementId
:   An element id.

#### Return Value

Boolean
True if the specified element id corresponds to a Rebar Shape element. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

Remarks The Rebar Shape has to be two dimensional shape only
 and its neighbouring segments may form only right angles.
 Rebar Shapes that have end treatments or crank ar not allowed. See Also

#### Reference

PathReinforcement Class Autodesk.Revit.DB.Structure Namespace